Tekla.Structures.Drawing.TextFile.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object relative to its current location.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.TextFile.Resize(Tekla.Structures.Drawing.Size)
Resizes the object to the specified size, overriding possible
scaling settings.
size: The new size.
Returns: True if succeeded.

Tekla.Structures.Drawing.TextFile.GetAxisAlignedBoundingBox
Gets the bounding box for the current object in the global axis coordinate system.
Returns: The rectangle bounding box for the current object.

Tekla.Structures.Drawing.TextFile.GetObjectAlignedBoundingBox
Gets the bounding box for the current object in its local coordinate system.
Returns: The rectangle bounding box for the current object.

Tekla.Structures.Drawing.TextFile.InsertionPoint
Gets or sets the insertion point.

Tekla.Structures.Drawing.TextFile.FileName
Gets or sets the file name the object is referring to.

Tekla.Structures.Drawing.TextFile.Size
Gets or sets the width and height of the text file. Changing this
property will change the scaling type to ScalingOptions.ScaleToFit.
Tekla.Structures.Drawing.ScalingOptions

Tekla.Structures.Drawing.TextFile.Angle
Gets or sets the angle (in degrees).